Revit 2026 API

# EnergyDataSettingsExportDefaults Property

---

Use for detailed model GreenBuildingXML export. When this setting is true, all building and space defaults, schedules, and constructions will be exported to GreenBuildingXML. When this setting is false, only values that are specified on the zone or space will be exported to GreenBuildingXML.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ExportDefaults { get; set; }
```
```vb
Public Property ExportDefaults As Boolean
	Get
	Set
```
```cpp
public:
property bool ExportDefaults {
	bool get ();
	void set (bool value);
}
```
```fsharp
member ExportDefaults : bool with get, set
```

#### Property Value

Boolean

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace